intersectSurfWithCurveNearEnd(Surface!System.Runtime.CompilerServices.IsConst*,GCurve!System.Runtime.CompilerServices.IsConst*,System.Int32,System.Double*,System.Double*,System.Boolean)
Intersect a surface and a curve and finds the intersection closes to
a specified end of the curve
Returns ERR_FAILURE if no intersections are found
Input: The surface, the curve, the end and the bWithinCurveBounds.
If bWithinCurveBounds is true, only intersection point that lie within the curve's bounds will be considered.
Outputs:  The parameter on the curve and the location of the intersection
both are optional